% 多元线性回归例1
% 合金的强度y与其中的碳含量x有比较密切的关系，今从生产中收集了一批,数据如下
% 试先拟合一个函数 y( x) ，再用回归分析对它进行检验。
% 0.首先观察大致呈线性关系
x=0.1:0.01:0.18;
y=[42,41.5,45,45.5,45,47.5,49,55,50];
plot(x,y,'+');
% 设y=b0+b1*x

% 1.1 用regress和rcoplot分析
clc;
clear;
x1=[0.1:0.01:0.18]';
y=[42,41.5,45,45.5,45,47.5,49,55,50]';
x=[ones(9,1),x1];
[b,bint,r,rint,stats]=regress(y,x);
b,bint,stats,rcoplot(r,rint)

% 1.2 反馈值意义
% b =
%   
%    27.4722       b0=27.4722
%    137.5000      b1=137.5000
% 
% bint =
% 
%    18.6851   36.2594      b0的置信区间是[18.6851,36.2594]
%    75.7755  199.2245      b1的置信区间是[75.7755,199.2245]
% 
% 
% stats =      R^2=0.7985,  F=27.7469,  p=0.0012  s^2=4.0883
% 
%     0.7985   27.7469    0.0012    4.0883


% 1.3 残差分析
% 图形发现，除第八个数据外其余残差的置信区间都包含零点，第八个点视为异常点，应剔除后重新计算。